## mesazon-apps-dev
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gateway_flyway.digitalocean_app.app: Refreshing state... [id=4a980713-a547-4fa7-b098-000e9843a1a6]
module.gateway_core.digitalocean_app.app: Refreshing state... [id=38436be3-b1df-44bf-83be-00a4eb1294e9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gateway_core.digitalocean_app.app is tainted, so must be replaced
-/+ resource "digitalocean_app" "app" {
      + active_deployment_id = (known after apply)
      ~ created_at           = "2026-02-05 22:09:35 +0000 UTC" -> (known after apply)
      + default_ingress      = (known after apply)
      ~ id                   = "38436be3-b1df-44bf-83be-00a4eb1294e9" -> (known after apply)
      + live_domain          = (known after apply)
      + live_url             = (known after apply)
      ~ updated_at           = "2026-02-05 22:11:55 +0000 UTC" -> (known after apply)
      ~ urn                  = "do:app:38436be3-b1df-44bf-83be-00a4eb1294e9" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ dedicated_ips (known after apply)

      ~ spec {
          ~ domains                         = [] -> (known after apply)
          ~ features                        = [
              - "buildpack-stack=ubuntu-22",
            ] -> (known after apply)
            name                            = "gateway-core-fra1-dev"
          ~ region                          = "fra" -> "fra1"
            # (3 unchanged attributes hidden)

          ~ domain (known after apply)

          ~ ingress (known after apply)
          - ingress {
              - rule {
                  - component {
                      - name                 = "gateway-core-service-fra1-dev" -> null
                      - preserve_path_prefix = false -> null
                        # (1 unchanged attribute hidden)
                    }
                  - match {
                      - path {
                          - prefix = "/" -> null
                        }
                    }
                }
            }

          ~ service {
              ~ http_port          = 8080 -> (known after apply)
              ~ internal_ports     = [] -> (known after apply)
                name               = "gateway-core-service-fra1-dev"
                # (7 unchanged attributes hidden)

              ~ image {
                  - registry             = "library" -> null
                  ~ registry_credentials = (sensitive value)
                    # (4 unchanged attributes hidden)

                  ~ deploy_on_push (known after apply)
                }

              ~ routes (known after apply)
            }
        }
    }

  # module.gateway_flyway.digitalocean_app.app will be updated in-place
  ~ resource "digitalocean_app" "app" {
        id                   = "4a980713-a547-4fa7-b098-000e9843a1a6"
        # (9 unchanged attributes hidden)

      ~ spec {
            name                            = "gateway-flyway-fra1-dev"
          ~ region                          = "fra" -> "fra1"
            # (5 unchanged attributes hidden)

          ~ job {
              ~ kind               = "POST_DEPLOY" -> "UNSPECIFIED"
                name               = "gateway-flyway-job-fra1-dev"
              + run_command        = "true"
                # (6 unchanged attributes hidden)

              ~ image {
                  - registry             = "library" -> null
                  ~ registry_credentials = (sensitive value)
                    # (4 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: No active deployment found for app: gateway-core-fra1-dev (38436be3-b1df-44bf-83be-00a4eb1294e9)

  with module.gateway_core.digitalocean_app.app,
  on ../../modules/app-service-noop/main.tf line 10, in resource "digitalocean_app" "app":
  10: resource "digitalocean_app" "app" {


─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>